8_beautiful_apps/tumblr/app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comments = @post.comments.create(params[:comment].permit(:name, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Abbie"], ["body", "Great Job! I'm proud of you, kiddo."], ["post_id", 1], ["created_at", 2017-01-02 05:56:23 UTC], ["updated_at", 2017-01-02 05:56:23 UTC]]