8_beautiful_apps/cabinet/app/controllers/docs_controller.rb

  def index
    @docs = Doc.where(user_id: current_user)
---
SELECT "docs".* FROM "docs" WHERE "docs"."user_id" IS NULL

  def create
    @doc = current_user.docs.build(doc_params)

    if @doc.save
---
INSERT INTO "docs" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "TEST DOC"], ["content", "Hipster Ipsum"], ["created_at", 2017-01-01 04:51:59 UTC], ["updated_at", 2017-01-01 04:51:59 UTC], ["user_id", 1]]

    def find_doc
      @doc = Doc.find(params[:id])
---
SELECT  "docs".* FROM "docs" WHERE "docs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]