8_beautiful_apps/hiptime/app/controllers/items_controller.rb

  def index
    if user_signed_in?
      @items = Item.where(:user_id => current_user.id).order("created_at DESC")
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]

  def create
    @item = current_user.items.build(item_params)
    if @item.save
---
INSERT INTO "items" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "title" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["title", "Porttitor Eros Purus Urna"], ["updated_at", 2017-01-08 03:13:52 UTC], ["id", 2]]

  def complete
    @item = Item.find(params[:id])
    @item.update_attribute(:completed_at, Time.now)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "items" SET "completed_at" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["completed_at", 2017-01-08 06:39:12 UTC], ["updated_at", 2017-01-08 06:39:12 UTC], ["id", 8]]

  def find_item
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]