8_beautiful_apps/hiptime/app/controllers/items_controller.rb

SELECT "items".* FROM "items" ORDER BY created_at DESC
---
  def index
    @items = Item.all.order("created_at DESC")