8_beautiful_apps/instagram/app/controllers/pics_controller.rb

  def index
    @pics = Pic.all.order("created_at DESC")
---
SELECT "pics".* FROM "pics" ORDER BY created_at DESC

  def create
    @pic = current_user.pics.build(pic_params)

    if @pic.save
---
INSERT INTO "pics" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["description", "test"], ["created_at", 2017-01-03 01:57:22 UTC], ["updated_at", 2017-01-03 01:57:22 UTC]]

  def update
    if @pic.update(pic_params)
---
UPDATE "pics" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "pics"."id" = ?  [["title", "Test Picture"], ["description", "Test TEST TEST"], ["updated_at", 2017-01-03 02:20:31 UTC], ["id", 1]]

  def destroy
    @pic.destroy
---
DELETE FROM "pics" WHERE "pics"."id" = ?  [["id", 1]]

  def find_pic
    @pic = Pic.find(params[:id])
---
SELECT  "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]